# Terraform - genesis
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
src/shared/infrastructure/genesis relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/genesis/runs/run-XuzKCXCt3atHGoRx

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.common_resources_staging.data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refreshing...
module.common_resources_production.data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
tfe_project.shared_project_name: Refreshing state... [id=prj-an2xGNaN8LJJq3Rq]
module.common_resources_production.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_production.tfe_project.default: Refreshing state... [id=prj-C9fFbLbbQu8Vj3gt]
tfe_workspace.shared: Refreshing state... [id=ws-8FdpSadNUXS8SoeH]
module.common_resources_production.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-GA24H3Hc4qVPyHFv]
module.common_resources_production.module.web.tfe_workspace.web: Refreshing state... [id=ws-rsgHQTJkzSH2jB9c]
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-8ukRyLqbCpidqQUL]
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-grK4xEKPjrpR49ZJ]
module.common_resources_production.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-V2FKSkPUTACr8mzL]
module.common_resources_production.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-BrVXzMpNHsVjptD7]
module.common_resources_production.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-qq73VQ2iCSENcTS1]
module.common_resources_production.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-SZPVL3Js61u15n7u]
module.common_resources_staging.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_production.module.customer.tfe_workspace.customer_processor: Refreshing state... [id=ws-7euszixFD2mP6c34]
module.common_resources_production.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-aqkxdiUHc4zhCYqa]
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-zMaTtQ9VYRuBZ8Tf]
module.common_resources_production.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-wpWEnjWPd72e8NS8]
module.common_resources_staging.tfe_project.default: Refreshing state... [id=prj-KiBz8S78U8v49z4m]
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-U9p6XUvn6xZy2Tex]
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-AzCCPgvfeuVBg21F]
module.common_resources_staging.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-TWH3WZCTRpPdj5eE]
module.common_resources_staging.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-Rs7PbD4eS4wFzyVb]
module.common_resources_staging.module.customer.tfe_workspace.customer_processor: Refreshing state... [id=ws-D11v5jb96MBu75XZ]
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-fBfXmsZEm4wFjnGq]
module.common_resources_staging.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-GGqkMHcwicvbcKGj]
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-n4Ais3n48dQnCv6U]
module.common_resources_staging.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-HMvtu1Fk24JoPDuo]
module.common_resources_staging.module.web.tfe_workspace.web: Refreshing state... [id=ws-XcWqkmRPBFDnSpLK]
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-3RCVzUn4d7Gq6rBp]
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-nYW6HXWycfiqQoPr]
module.common_resources_production.module.customer.tfe_workspace.customer_processor: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
tfe_workspace.shared: Drift detected (update)
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_production.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_staging.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer_processor: Drift detected (update)
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_staging.module.web.tfe_workspace.web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources_production.module.connect.tfe_workspace.connect will be created
  + resource "tfe_workspace" "connect" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_connect"
      + operations                    = (known after apply)
      + organization                  = "Connectilly"
      + project_id                    = "prj-C9fFbLbbQu8Vj3gt"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "connect",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/connect/shared/infrastructure/workspaces/production"
    }

  # module.common_resources_production.module.connect.tfe_workspace.connect_api will be created
  + resource "tfe_workspace" "connect_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_connect_api"
      + operations                    = (known after apply)
      + organization                  = "Connectilly"
      + project_id                    = "prj-C9fFbLbbQu8Vj3gt"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "connect",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/connect/connect-api/infrastructure/workspaces/production"
    }

  # module.common_resources_staging.module.connect.tfe_workspace.connect will be created
  + resource "tfe_workspace" "connect" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging_connect"
      + operations                    = (known after apply)
      + organization                  = "Connectilly"
      + project_id                    = "prj-KiBz8S78U8v49z4m"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "connect",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/connect/shared/infrastructure/workspaces/staging"
    }

  # module.common_resources_staging.module.connect.tfe_workspace.connect_api will be created
  + resource "tfe_workspace" "connect_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging_connect_api"
      + operations                    = (known after apply)
      + organization                  = "Connectilly"
      + project_id                    = "prj-KiBz8S78U8v49z4m"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "connect",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/connect/connect-api/infrastructure/workspaces/staging"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 32 estimated
           $0.0/mo +$0.0

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*